tutorials/multiphaseReactiveTransport/interReactiveTransportFoam/2DGrainstonesMultiphaseReactiveTransport/0_org/Surf_aH
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Surf_aH;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -2 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{
	walls
    {
        type           fixedValue;
	value uniform SurfDen;
    }

	solidwalls
    {
        type           fixedValue;
	value uniform SurfDen;
    }

	inlet
    {
	type            zeroGradient;
    }
	
	outlet
    {
        type            zeroGradient;
    }

    frontAndBack
    {
        type empty;

    }
}

// ************************************************************************* //
