tutorials/multiphaseReactiveTransport/interReactiveTransportFoam/2DGrainstonesMultiphaseReactiveTransport/0_org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet 
    {
        type            flowRateInletVelocity;
        volumetricFlowRate        flowrate;//3.41e-8;
        value uniform (0 0 0);
    }
    
    outlet 
    {
        type            zeroGradient;
    }

    walls 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    solidwalls 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }


    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
